# Window LAG

## COVID-19 Data
Notes on the data: This data was assembled based on work done by [Rodrigo Pombo](https://github.com/pomber/covid19) based on [John Hopkins University](https://systems.jhu.edu/research/public-health/ncov/), based on [World Health Organisation](https://www.who.int/health-topics/coronavirus). The data was assembled 21st April 2020 - there are no plans to keep this data set up to date.

In [1]:
# Prerequesites
from pyhive import hive
%load_ext sql
%sql hive://cloudera@quickstart.cloudera:10000/sqlzoo
%config SqlMagic.displaylimit = 20

 路路路路

## Window Function
The SQL Window functions include LAG, LEAD, RANK and NTILE. These functions operate over a "window" of rows - typically these are rows in the table that are in some sense adjacent.

## 1. Introducing the `covid` table

The example uses a WHERE clause to show the cases in 'Italy' in March.

```sql
SELECT name, DAY(whn),
 confirmed, deaths, recovered
 FROM covid
WHERE name = 'Italy'
AND MONTH(whn) = 3
ORDER BY whn
```

**Modify the query to show data from Spain**

In [2]:
%%sql
SELECT name, EXTRACT(DAY FROM whn) whn, confirmed, deaths, recovered
  FROM covid
    WHERE name='Spain' AND EXTRACT(MONTH FROM whn)=3
    ORDER BY whn;

 * postgresql://postgres:***@localhost/sqlzoo
31 rows affected.

[('Spain', 1.0, 84, 0, 2),
 ('Spain', 2.0, 120, 0, 2),
 ('Spain', 3.0, 165, 1, 2),
 ('Spain', 4.0, 222, 2, 2),
 ('Spain', 5.0, 259, 3, 2),
 ('Spain', 6.0, 400, 5, 2),
 ('Spain', 7.0, 500, 10, 30),
 ('Spain', 8.0, 673, 17, 30),
 ('Spain', 9.0, 1073, 28, 32),
 ('Spain', 10.0, 1695, 35, 32),
 ('Spain', 11.0, 2277, 54, 183),
 ('Spain', 12.0, 2277, 55, 183),
 ('Spain', 13.0, 5232, 133, 193),
 ('Spain', 14.0, 6391, 195, 517),
 ('Spain', 15.0, 7798, 289, 517),
 ('Spain', 16.0, 9942, 342, 530),
 ('Spain', 17.0, 11748, 533, 1028),
 ('Spain', 18.0, 13910, 623, 1081),
 ('Spain', 19.0, 17963, 830, 1107),
 ('Spain', 20.0, 20410, 1043, 1588),
 ('Spain', 21.0, 25374, 1375, 2125),
 ('Spain', 22.0, 28768, 1772, 2575),
 ('Spain', 23.0, 35136, 2311, 2575),
 ('Spain', 24.0, 39885, 2808, 3794),
 ('Spain', 25.0, 49515, 3647, 5367),
 ('Spain', 26.0, 57786, 4365, 7015),
 ('Spain', 27.0, 65719, 5138, 9357),
 ('Spain', 28.0, 73235, 5982, 12285),
 ('Spain', 29.0, 80110, 6803, 14709),
 ('Spain', 30.0, 87956, 7716, 16780),
 ('Spain', 31.0, 95923, 8464, 19259)]

## 2. Introducing the LAG function

The LAG function is used to show data from the preceding row or the table. When lining up rows the data is partitioned by country name and ordered by the data whn. That means that only data from Italy is considered.

```sql
SELECT name, DAY(whn), confirmed,
   LAG(whn, 1) OVER (PARTITION BY name ORDER BY whn)
 FROM covid
WHERE name = 'Italy'
AND MONTH(whn) = 3
ORDER BY whn
```

**Modify the query to show confirmed for the day before.**

In [3]:
%%sql
SELECT name, EXTRACT(DAY FROM whn), confirmed,
  LAG(confirmed, 1) OVER (PARTITION BY name ORDER BY whn) AS lag_confirmed
    FROM covid
    WHERE name='Italy' AND EXTRACT(MONTH FROM whn)=3
    ORDER BY whn;

 * postgresql://postgres:***@localhost/sqlzoo
31 rows affected.

[('Italy', 1.0, 1694, None),
 ('Italy', 2.0, 2036, 1694),
 ('Italy', 3.0, 2502, 2036),
 ('Italy', 4.0, 3089, 2502),
 ('Italy', 5.0, 3858, 3089),
 ('Italy', 6.0, 4636, 3858),
 ('Italy', 7.0, 5883, 4636),
 ('Italy', 8.0, 7375, 5883),
 ('Italy', 9.0, 9172, 7375),
 ('Italy', 10.0, 10149, 9172),
 ('Italy', 11.0, 12462, 10149),
 ('Italy', 12.0, 12462, 12462),
 ('Italy', 13.0, 17660, 12462),
 ('Italy', 14.0, 21157, 17660),
 ('Italy', 15.0, 24747, 21157),
 ('Italy', 16.0, 27980, 24747),
 ('Italy', 17.0, 31506, 27980),
 ('Italy', 18.0, 35713, 31506),
 ('Italy', 19.0, 41035, 35713),
 ('Italy', 20.0, 47021, 41035),
 ('Italy', 21.0, 53578, 47021),
 ('Italy', 22.0, 59138, 53578),
 ('Italy', 23.0, 63927, 59138),
 ('Italy', 24.0, 69176, 63927),
 ('Italy', 25.0, 74386, 69176),
 ('Italy', 26.0, 80589, 74386),
 ('Italy', 27.0, 86498, 80589),
 ('Italy', 28.0, 92472, 86498),
 ('Italy', 29.0, 97689, 92472),
 ('Italy', 30.0, 101739, 97689),
 ('Italy', 31.0, 105792, 101739)]

### LAG operation

Here is the correct query showing the cases for the day before:

```sql
SELECT name, DAY(whn), confirmed,
   LAG(confirmed, 1) OVER (partition by name ORDER BY whn) AS lag
 FROM covid
WHERE name = 'Italy'
AND MONTH(whn) = 3
ORDER BY whn
```

Notice how the values in the LAG column match the value of the row diagonally above and to the left.

name | DAY(whn) | confirmed | dbf
------|---|------|----------
Italy | 1 | **1694** | null
Italy | 2 | 2036 | **1694**
Italy | 3 | 2502 | 2036
Italy | 4 | 3089 | 2502
Italy | 5 | **3858** | 3089
Italy | 6 | 4636 | **3858**
Italy | 7 | 5883 | 4636
Italy | 8 | 7375 | 5883
Italy | 9 | 9172 | 7375
Italy | 10 | 10149 | 9172
... | | |

## 3. Number of new cases

The number of confirmed case is cumulative - but we can use LAG to recover the number of new cases reported for each day.

```sql
SELECT name, DAY(whn), confirmed,
   LAG(confirmed, 1) OVER (PARTITION BY name ORDER BY whn)
 FROM covid
WHERE name = 'Italy'
AND MONTH(whn) = 3
ORDER BY whn
```

**Show the number of new cases for each day, for Italy, for March.**

In [4]:
%%sql
SELECT name, EXTRACT(DAY FROM whn), 
  confirmed - LAG(confirmed, 1) OVER (PARTITION BY name ORDER BY whn) AS new
    FROM covid
    WHERE name = 'Italy' AND EXTRACT(MONTH FROM whn) = 3
    ORDER BY whn;

 * postgresql://postgres:***@localhost/sqlzoo
31 rows affected.

[('Italy', 1.0, None),
 ('Italy', 2.0, 342),
 ('Italy', 3.0, 466),
 ('Italy', 4.0, 587),
 ('Italy', 5.0, 769),
 ('Italy', 6.0, 778),
 ('Italy', 7.0, 1247),
 ('Italy', 8.0, 1492),
 ('Italy', 9.0, 1797),
 ('Italy', 10.0, 977),
 ('Italy', 11.0, 2313),
 ('Italy', 12.0, 0),
 ('Italy', 13.0, 5198),
 ('Italy', 14.0, 3497),
 ('Italy', 15.0, 3590),
 ('Italy', 16.0, 3233),
 ('Italy', 17.0, 3526),
 ('Italy', 18.0, 4207),
 ('Italy', 19.0, 5322),
 ('Italy', 20.0, 5986),
 ('Italy', 21.0, 6557),
 ('Italy', 22.0, 5560),
 ('Italy', 23.0, 4789),
 ('Italy', 24.0, 5249),
 ('Italy', 25.0, 5210),
 ('Italy', 26.0, 6203),
 ('Italy', 27.0, 5909),
 ('Italy', 28.0, 5974),
 ('Italy', 29.0, 5217),
 ('Italy', 30.0, 4050),
 ('Italy', 31.0, 4053)]

## 4. Weekly changes

The data gathered are necessarily estimates and are inaccurate. However by taking a longer time span we can mitigate some of the effects.

```sql
SELECT name, DATE_FORMAT(whn,'%Y-%m-%d'), confirmed
 FROM covid
WHERE name = 'Italy'
AND WEEKDAY(whn) = 0
ORDER BY whn
```

You can filter the data to view only Monday's figures **WHERE WEEKDAY(whn) = 0**.

**Show the number of new cases in Italy for each week - show Monday only.**

In [5]:
%%sql
SELECT name, TO_CHAR(whn, 'yyyy-mm-dd'), 
  confirmed-LAG(confirmed, 1) OVER (PARTITION BY name ORDER BY whn) AS new
    FROM covid
    WHERE name = 'Italy' AND EXTRACT(DOW FROM whn) = 0
    ORDER BY whn;

 * postgresql://postgres:***@localhost/sqlzoo
13 rows affected.

[('Italy', '2020-01-26', None),
 ('Italy', '2020-02-02', 2),
 ('Italy', '2020-02-09', 1),
 ('Italy', '2020-02-16', 0),
 ('Italy', '2020-02-23', 152),
 ('Italy', '2020-03-01', 1539),
 ('Italy', '2020-03-08', 5681),
 ('Italy', '2020-03-15', 17372),
 ('Italy', '2020-03-22', 34391),
 ('Italy', '2020-03-29', 38551),
 ('Italy', '2020-04-05', 31259),
 ('Italy', '2020-04-12', 27415),
 ('Italy', '2020-04-19', 22609)]

## 5. LAG using a JOIN

You can JOIN a table using DATE arithmetic. This will give different results if data is missing.

```sql
SELECT tw.name, DATE_FORMAT(tw.whn,'%Y-%m-%d'), 
 tw.confirmed, lw.confirmed
 FROM covid tw LEFT JOIN covid lw ON 
  DATE_ADD(lw.whn, INTERVAL 1 WEEK) = tw.whn
   AND tw.name=lw.name
WHERE tw.name = 'Italy'
ORDER BY tw.whn
```

**Show the number of new cases in Italy for each week - show Monday only.**

In the sample query we JOIN this week tw with last week lw using the DATE_ADD function.

In [6]:
%%sql
SELECT tw.name, TO_CHAR(tw.whn,'yyyy-mm-dd'), 
  tw.confirmed - lw.confirmed AS new
    FROM covid tw LEFT JOIN covid lw ON 
    lw.whn + INTERVAL '1w' = tw.whn AND tw.name=lw.name
    WHERE tw.name = 'Italy' AND EXTRACT(DOW FROM tw.whn)=0
    ORDER BY tw.whn;

 * postgresql://postgres:***@localhost/sqlzoo
13 rows affected.

[('Italy', '2020-01-26', None),
 ('Italy', '2020-02-02', 2),
 ('Italy', '2020-02-09', 1),
 ('Italy', '2020-02-16', 0),
 ('Italy', '2020-02-23', 152),
 ('Italy', '2020-03-01', 1539),
 ('Italy', '2020-03-08', 5681),
 ('Italy', '2020-03-15', 17372),
 ('Italy', '2020-03-22', 34391),
 ('Italy', '2020-03-29', 38551),
 ('Italy', '2020-04-05', 31259),
 ('Italy', '2020-04-12', 27415),
 ('Italy', '2020-04-19', 22609)]

## 6. RANK()

The query shown shows the number of confirmed cases together with the world ranking for cases.

United States has the highest number, Spain is number 2...

Notice that while Spain has the second highest confirmed cases, Italy has the second highest number of deaths due to the virus.

```sql
SELECT 
   name,
   confirmed,
   RANK() OVER (ORDER BY confirmed DESC) rc,
   deaths
  FROM covid
WHERE whn = '2020-04-20'
ORDER BY confirmed DESC
```

**Include the ranking for the number of deaths in the table. Only include countries with a population of at least 10 million.**

In [7]:
%%sql
SELECT 
  covid.name, confirmed,
    RANK() OVER (ORDER BY confirmed DESC) rc,
    deaths, RANK() OVER (ORDER BY deaths DESC) rc2
    FROM covid JOIN world ON (covid.name=world.name)
    WHERE whn = '2020-04-20' AND population>=10000000
    ORDER BY confirmed DESC;

 * postgresql://postgres:***@localhost/sqlzoo
90 rows affected.

[('United States', 784326, 1, 42094, 1),
 ('Spain', 200210, 2, 20852, 3),
 ('Italy', 181228, 3, 24114, 2),
 ('France', 156480, 4, 20292, 4),
 ('Germany', 147065, 5, 4862, 8),
 ('United Kingdom', 125856, 6, 16550, 5),
 ('Turkey', 90980, 7, 2140, 12),
 ('China', 83817, 8, 4636, 9),
 ('Iran', 83505, 9, 5209, 7),
 ('Russia', 47121, 10, 405, 23),
 ('Brazil', 40743, 11, 2587, 11),
 ('Belgium', 39983, 12, 5828, 6),
 ('Canada', 37657, 13, 1725, 13),
 ('Netherlands', 33588, 14, 3764, 10),
 ('Portugal', 20863, 15, 735, 15),
 ('India', 18539, 16, 592, 17),
 ('Peru', 16325, 17, 445, 21),
 ('Sweden', 14777, 18, 1580, 14),
 ('Japan', 10797, 19, 236, 27),
 ('South Korea', 10674, 20, 236, 27),
 ('Chile', 10507, 21, 139, 35),
 ('Saudi Arabia', 10484, 22, 103, 38),
 ('Ecuador', 10128, 23, 507, 19),
 ('Poland', 9593, 24, 380, 25),
 ('Romania', 8936, 25, 478, 20),
 ('Pakistan', 8418, 26, 176, 32),
 ('Mexico', 8261, 27, 686, 16),
 ('Czech Republic', 6900, 28, 194, 30),
 ('Indonesia', 6760, 29, 590, 18),
 ('Australia', 6547, 30, 67, 42),
 ('Philippines', 6459, 31, 428, 22),
 ('Ukraine', 5710, 32, 151, 33),
 ('Malaysia', 5425, 33, 89, 40),
 ('Dominican Republic', 4964, 34, 235, 29),
 ('Colombia', 3977, 35, 189, 31),
 ('Egypt', 3333, 36, 250, 26),
 ('South Africa', 3300, 37, 58, 43),
 ('Morocco', 3046, 38, 143, 34),
 ('Bangladesh', 2948, 39, 101, 39),
 ('Argentina', 2941, 40, 136, 36),
 ('Thailand', 2792, 41, 47, 44),
 ('Algeria', 2718, 42, 384, 24),
 ('Greece', 2245, 43, 116, 37),
 ('Kazakhstan', 1852, 44, 19, 54),
 ('Uzbekistan', 1627, 45, 5, 68),
 ('Iraq', 1574, 46, 82, 41),
 ('Azerbaijan', 1436, 47, 19, 54),
 ('Cameroon', 1163, 48, 42, 45),
 ('Cuba', 1087, 49, 36, 48),
 ('Ghana', 1042, 50, 9, 60),
 ('Afghanistan', 1026, 51, 36, 48),
 ('Tunisia', 884, 52, 38, 46),
 ("C么te d'Ivoire", 847, 53, 9, 60),
 ('Nigeria', 665, 54, 22, 52),
 ('Niger', 648, 55, 20, 53),
 ('Guinea', 622, 56, 5, 68),
 ('Burkina Faso', 581, 57, 38, 46),
 ('Bolivia', 564, 58, 33, 50),
 ('Jordan', 425, 59, 7, 64),
 ('Taiwan', 422, 60, 6, 67),
 ('Senegal', 377, 61, 5, 68),
 ('Congo, Democratic Republic of', 332, 62, 25, 51),
 ('Sri Lanka', 304, 63, 7, 64),
 ('Guatemala', 289, 64, 7, 64),
 ('Kenya', 281, 65, 14, 56),
 ('Vietnam', 268, 66, 0, 81),
 ('Venezuela', 256, 67, 9, 60),
 ('Tanzania', 254, 68, 10, 59),
 ('Mali', 246, 69, 14, 56),
 ('Somalia', 237, 70, 8, 63),
 ('Rwanda', 147, 71, 0, 81),
 ('Cambodia', 122, 72, 0, 81),
 ('Madagascar', 121, 73, 0, 81),
 ('Myanmar', 119, 74, 5, 68),
 ('Ethiopia', 111, 75, 3, 72),
 ('Sudan', 107, 76, 12, 58),
 ('Zambia', 65, 77, 3, 72),
 ('Haiti', 57, 78, 3, 72),
 ('Uganda', 56, 79, 0, 81),
 ('Benin', 54, 80, 1, 79),
 ('Syria', 39, 81, 3, 72),
 ('Mozambique', 39, 81, 0, 81),
 ('Chad', 33, 83, 0, 81),
 ('Nepal', 31, 84, 0, 81),
 ('Zimbabwe', 25, 85, 3, 72),
 ('Angola', 24, 86, 2, 77),
 ('Malawi', 17, 87, 2, 77),
 ('Burundi', 5, 88, 1, 79),
 ('South Sudan', 4, 89, 0, 81),
 ('Yemen', 1, 90, 0, 81)]

## 7. Infection rate

The query shown includes a JOIN t the world table so we can access the total population of each country and calculate infection rates (in cases per 100,000).

```sql
SELECT 
   world.name,
   ROUND(100000*confirmed/population,0)
  FROM covid JOIN world ON covid.name=world.name
WHERE whn = '2020-04-20' AND population > 10000000
ORDER BY population DESC
```

**Show the infect rate ranking for each country. Only include countries with a population of at least 10 million.**

In [8]:
%%sql
SELECT 
   world.name,
    ROUND(100000*confirmed/population,0),
    RANK() OVER (ORDER BY confirmed/population)
    FROM covid JOIN world ON covid.name=world.name
    WHERE whn = '2020-04-20' AND population > 10000000
    ORDER BY population DESC

 * postgresql://postgres:***@localhost/sqlzoo
90 rows affected.

[('China', Decimal('6'), 52),
 ('India', Decimal('1'), 28),
 ('United States', Decimal('238'), 87),
 ('Indonesia', Decimal('3'), 35),
 ('Pakistan', Decimal('4'), 42),
 ('Brazil', Decimal('19'), 65),
 ('Nigeria', Decimal('0'), 16),
 ('Bangladesh', Decimal('2'), 32),
 ('Russia', Decimal('32'), 71),
 ('Mexico', Decimal('7'), 54),
 ('Japan', Decimal('9'), 59),
 ('Philippines', Decimal('6'), 51),
 ('Egypt', Decimal('3'), 39),
 ('Ethiopia', Decimal('0'), 7),
 ('Vietnam', Decimal('0'), 15),
 ('Iran', Decimal('100'), 79),
 ('Turkey', Decimal('109'), 80),
 ('Germany', Decimal('177'), 82),
 ('Congo, Democratic Republic of', Decimal('0'), 21),
 ('France', Decimal('233'), 86),
 ('Thailand', Decimal('4'), 45),
 ('United Kingdom', Decimal('189'), 83),
 ('Italy', Decimal('301'), 88),
 ('South Africa', Decimal('6'), 50),
 ('Tanzania', Decimal('0'), 18),
 ('Myanmar', Decimal('0'), 12),
 ('South Korea', Decimal('21'), 66),
 ('Colombia', Decimal('8'), 57),
 ('Kenya', Decimal('1'), 23),
 ('Spain', Decimal('425'), 90),
 ('Argentina', Decimal('7'), 55),
 ('Algeria', Decimal('6'), 53),
 ('Sudan', Decimal('0'), 14),
 ('Ukraine', Decimal('14'), 62),
 ('Uganda', Decimal('0'), 9),
 ('Iraq', Decimal('4'), 44),
 ('Poland', Decimal('25'), 68),
 ('Canada', Decimal('99'), 78),
 ('Morocco', Decimal('8'), 58),
 ('Saudi Arabia', Decimal('31'), 70),
 ('Uzbekistan', Decimal('5'), 47),
 ('Malaysia', Decimal('17'), 64),
 ('Afghanistan', Decimal('3'), 38),
 ('Venezuela', Decimal('1'), 24),
 ('Peru', Decimal('51'), 74),
 ('Angola', Decimal('0'), 4),
 ('Ghana', Decimal('3'), 40),
 ('Mozambique', Decimal('0'), 8),
 ('Nepal', Decimal('0'), 6),
 ('Yemen', Decimal('0'), 1),
 ('Cameroon', Decimal('4'), 46),
 ('Madagascar', Decimal('0'), 20),
 ('Australia', Decimal('25'), 69),
 ("C么te d'Ivoire", Decimal('4'), 41),
 ('Taiwan', Decimal('2'), 33),
 ('Niger', Decimal('3'), 37),
 ('Sri Lanka', Decimal('1'), 29),
 ('Burkina Faso', Decimal('3'), 36),
 ('Mali', Decimal('1'), 27),
 ('Romania', Decimal('46'), 72),
 ('Malawi', Decimal('0'), 5),
 ('Chile', Decimal('55'), 75),
 ('Kazakhstan', Decimal('10'), 61),
 ('Zambia', Decimal('0'), 17),
 ('Syria', Decimal('0'), 13),
 ('Ecuador', Decimal('58'), 76),
 ('Netherlands', Decimal('192'), 84),
 ('Guatemala', Decimal('2'), 31),
 ('Chad', Decimal('0'), 11),
 ('Senegal', Decimal('2'), 34),
 ('Somalia', Decimal('1'), 30),
 ('Cambodia', Decimal('1'), 25),
 ('Zimbabwe', Decimal('0'), 10),
 ('South Sudan', Decimal('0'), 2),
 ('Rwanda', Decimal('1'), 26),
 ('Guinea', Decimal('5'), 49),
 ('Benin', Decimal('0'), 19),
 ('Tunisia', Decimal('8'), 56),
 ('Haiti', Decimal('0'), 22),
 ('Belgium', Decimal('347'), 89),
 ('Bolivia', Decimal('5'), 48),
 ('Cuba', Decimal('10'), 60),
 ('Burundi', Decimal('0'), 3),
 ('Greece', Decimal('21'), 67),
 ('Czech Republic', Decimal('65'), 77),
 ('Jordan', Decimal('4'), 43),
 ('Dominican Republic', Decimal('48'), 73),
 ('Sweden', Decimal('143'), 81),
 ('Portugal', Decimal('203'), 85),
 ('Azerbaijan', Decimal('14'), 63)]

## 8. Turning the corner

For each country that has had at last 1000 new cases in a single day, show the date of the peak number of new cases.

In [9]:
%%sql
WITH t AS (
    SELECT name, whn,
       COALESCE(confirmed-LAG(confirmed, 1) OVER 
                (PARTITION BY name ORDER BY whn), 0) AS new_cases
    FROM covid
), r AS (
    SELECT name, whn, new_cases,
       RANK() OVER (PARTITION BY name ORDER BY new_cases DESC) AS rank_new
    FROM t
)
SELECT name, whn, new_cases FROM r
    WHERE rank_new=1 AND new_cases>1000
    ORDER BY whn, name;

 * postgresql://postgres:***@localhost/sqlzoo
26 rows affected.

[('China', datetime.date(2020, 2, 13), 15136),
 ('Italy', datetime.date(2020, 3, 21), 6557),
 ('Switzerland', datetime.date(2020, 3, 23), 1321),
 ('Israel', datetime.date(2020, 3, 25), 1131),
 ('Spain', datetime.date(2020, 3, 25), 9630),
 ('Austria', datetime.date(2020, 3, 26), 1321),
 ('Germany', datetime.date(2020, 3, 27), 6933),
 ('Iran', datetime.date(2020, 3, 30), 3186),
 ('Canada', datetime.date(2020, 4, 5), 2778),
 ('Ecuador', datetime.date(2020, 4, 10), 2196),
 ('Ireland', datetime.date(2020, 4, 10), 1515),
 ('Netherlands', datetime.date(2020, 4, 10), 1346),
 ('Portugal', datetime.date(2020, 4, 10), 1516),
 ('United Kingdom', datetime.date(2020, 4, 10), 8733),
 ('United States', datetime.date(2020, 4, 10), 33755),
 ('Turkey', datetime.date(2020, 4, 11), 5138),
 ('France', datetime.date(2020, 4, 12), 26849),
 ('Peru', datetime.date(2020, 4, 13), 2265),
 ('Belgium', datetime.date(2020, 4, 15), 2454),
 ('Brazil', datetime.date(2020, 4, 17), 3257),
 ('Japan', datetime.date(2020, 4, 17), 1161),
 ('Saudi Arabia', datetime.date(2020, 4, 18), 1132),
 ('India', datetime.date(2020, 4, 19), 1893),
 ('Russia', datetime.date(2020, 4, 19), 6060),
 ('Belarus', datetime.date(2020, 4, 20), 1485),
 ('Singapore', datetime.date(2020, 4, 20), 1426)]